module.exports.config = {

  'name': 'wish',

  'version': "1.0.0",

  'hasPermssion': 2,

  'credits': "CYBER-SUJON",

  'description': "5 বারের জন্য ক্রমাগত বন্ধুর ট্যাগ ট্যাগ করুন\nসেই ব্যক্তিকে আত্মা কলিং বলা যেতে পারে",

  'commandCategory': "game",

  'usages': " please @mention",

  'cooldowns': 0xa,

  'dependencies': {

    'fs-extra': '',

    'axios': ''

  }

};

module.exports.run = async function ({

  api: _0x1d1d14,

  args: _0x13bccb,

  Users: _0x22bcbe,

  event: _0x2ab44e

}) {

  var _0x3cddae = Object.keys(_0x2ab44e.mentions)[0];

  if (!_0x3cddae) {

    return _0x1d1d14.sendMessage("আপনি জন্মদিন এ উইশ করতে চান এমন 1 জনকে @ম্যানশন করতে হবে", _0x2ab44e.threadID);

  }

  let _0x26de92 = _0x2ab44e.mentions[_0x3cddae];

  var _0x2a46a9 = [];

  _0x2a46a9.push({

    'id': _0x3cddae,

    'tag': _0x26de92

  });

  var _0x1cb78a = function (_0x5518f5) {

    _0x1d1d14.sendMessage(_0x5518f5, _0x2ab44e.threadID);

  };

  _0x1cb78a("𝐋𝐞𝐭'𝐬 𝐬𝐭𝐚𝐫𝐭 𝐭𝐨 𝐁𝐢𝐫𝐭𝐡𝐝𝐚𝐲 𝐰𝐢𝐬𝐡.𝗦𝗨𝗝𝗢𝗡-𝗕𝗢𝗦𝗦 ");

  setTimeout(() => {

    _0x1cb78a({

      'body': "শুভ জন্মদিন! আশা করি আজকের এই বিশেষ দিনে প্রত্যেকটি মুহূর্ত যেন আনন্দ এবং খুশি দিয়ে ভরে ওঠে।। " + _0x26de92,

      'mentions': _0x2a46a9

    });

  }, 3000);

  setTimeout(() => {

    _0x1cb78a({

      'body': "এই বিশেষ দিনে সুজন এর পক্ষ থেকে জানাই শুভ জন্মদিন! " + _0x26de92,

      'mentions': _0x2a46a9

    });

  }, 5000);

  setTimeout(() => {

    _0x1cb78a({

      'body': "একটি জন্মদিন একটি নতুন শুরু, একটি জন্মদিন আরেকটি সুন্দর বছরের প্রথম দিন…শুভ জন্মদিন! " + _0x26de92,

      'mentions': _0x2a46a9

    });

  }, 7000);

  setTimeout(() => {

    _0x1cb78a({

      'body': "আশা করি আজকের এই দিনে তোমার জীবনে অনেক হাসি এবং খুশিতে ভরে উঠুক। একটি অসাধারণ দিনের জন্য তোমাকে অনেক শুভেচ্ছা জানালাম। শুভ জন্মদিন! " + _0x26de92,

      'mentions': _0x2a46a9

    });

  }, 9000);

  setTimeout(() => {

    _0x1cb78a({

      'body': "আশা করি তোমার এই শুভ দিনটি কেকের মতো মিষ্টি হবে।  হ্যাপি বার্থ ডে টু ইউ " + _0x26de92,

      'mentions': _0x2a46a9

    });

  }, 12000);

  setTimeout(() => {

    _0x1cb78a({

      'body': "জন্মদিন একটি নতুন বছরের মতো এবং আপনার জন্য আমার সুখ পূর্ণ একটি দুর্দান্ত বছর কামনা রইল। শুভ জন্মদিন! " + _0x26de92,

      'mentions': _0x2a46a9

    });

  }, 15000);

  setTimeout(() => {

    _0x1cb78a({

      'body': "আমি আশা করি আপনার সব ইচ্ছা পূরণ হবে। শুভ জন্মদিন! " + _0x26de92,

      'mentions': _0x2a46a9

    });

  }, 17000);

  setTimeout(() => {

    _0x1cb78a({

      'body': "_শুভ জন্মদিন আলোকিত হোক ভবিষ্যৎ। প্রতিটা দিন কাটুক সুন্দর ভাবে।সুখ দিয়ে পরিপূর্ণ হোক জীবন। " + _0x26de92,

      'mentions': _0x2a46a9

    });

  }, 20000);

  setTimeout(() => {

    _0x1cb78a({

      'body': "সুন্দর মন প্রাণ রত্ন হােক আপনার।আগামীর প্রতিটা সময়, সূর্যদয় ও চাঁদের।আলােয় উদ্ধভাসিত হােক তোমার জীবনের প্রতিটা মুহূর্ত 🙂আনন্দময় হােক!এই শুভকামনা করি ❤❤ " + _0x26de92,

      'mentions': _0x2a46a9

    });

  }, 23000);

  setTimeout(() => {

    _0x1cb78a({

      'body': "ღ__সুন্দর এই ভূবনে সুন্দরতম জীবন হোক তোর 😻🥰ღ পূরন হোক প্রতিটি স্বপ্ন প্রতিটি আশা বেচেঁ থাক হাজার বছর!!🤍🥀 " + _0x26de92,

      'mentions': _0x2a46a9

    });

  }, 25000);

  setTimeout(() => {

    _0x1cb78a({

      'body': "𝐁𝐫𝐢𝐠𝐡𝐭𝐞𝐧 𝐭𝐡𝐞 𝐟𝐮𝐭𝐮𝐫𝐞. 𝐁𝐮𝐢𝐥𝐝 𝐚 𝐛𝐞𝐚𝐮𝐭𝐢𝐟𝐮𝐥 𝐥𝐢𝐟𝐞. 𝐀𝐜𝐜𝐞𝐩𝐭 𝐛𝐢𝐫𝐭𝐡𝐝𝐚𝐲 𝐰𝐢𝐬𝐡𝐞𝐬 " + _0x26de92,

      'mentions': _0x2a46a9

    });

  }, 28500);

  setTimeout(() => {

    _0x1cb78a({

      'body': "𝐖𝐢𝐬𝐡 𝐲𝐨𝐮 𝐚𝐥𝐥 𝐭𝐡𝐞 𝐛𝐞𝐬𝐭 𝐨𝐧 𝐭𝐡𝐢𝐬 𝐬𝐩𝐞𝐜𝐢𝐚𝐥 𝐦𝐨𝐦𝐞𝐧𝐭𝐬 " + _0x26de92,

      'mentions': _0x2a46a9

    });

  }, 31000);

  setTimeout(() => {

    _0x1cb78a({

      'body': "𝐃𝐨 𝐬𝐨𝐦𝐞𝐭𝐡𝐢𝐧𝐠 𝐧𝐞𝐰 𝐢𝐧 𝐭𝐡𝐞 𝐟𝐮𝐭𝐮𝐫𝐞. 𝐀𝐯𝐞𝐫𝐚𝐠𝐞 𝐠𝐨𝐨𝐝 𝐥𝐢𝐟𝐞 𝐰𝐢𝐭𝐡 𝐧𝐞𝐰 𝐨𝐧𝐞𝐬 " + _0x26de92,

      'mentions': _0x2a46a9

    });

  }, 36000);

  setTimeout(() => {

    _0x1cb78a("𝐇𝐚𝐩𝐩𝐲 𝐁𝐢𝐫𝐭𝐡𝐝𝐚𝐲");

  }, 39000);

};