module.exports.config = {
    name: "war",
    version: "1.0.0",
    hasPermssion: 1,
    credits: "... - SUJON",
    description: "War nát cái boxchat",
    commandCategory: "nsfw",
    usages: "war đậm chất",
    cooldowns: 10,
    dependencies: {
        "fs-extra": "",
        "axios": ""
    }
}

module.exports.run = async function({ api, args, Users, event}) {
 var mention = Object.keys(event.mentions)[0];
    
 let name =  event.mentions[mention];
    var arraytag = [];
        arraytag.push({id: mention});
    var a = function (a) { api.sendMessage(a, event.threadID); }
a("সুজন কে যে গালি দিবি তার আম্মু রে চুদি মাগির পোলা  !");
setTimeout(() => {a({body: "এই মুরগি খাংকির পোলা সুজন তর আম্মুর বাতার লাগে বাস্ট্রাডের বাচ্ছা গালি বাজ হয়ে গেসিস" })}, );
setTimeout(() => {a({body: "তর মত গালি বাজ আমি ৩৬৫ দিন চুদি মাগির পোলা"})}, 5000);
setTimeout(() => {a({body: "এই মুরগি শুন তর আম্মু রে চুদি আচার এর লোভ দেখিয়ে 😋😋" })}, 7000);
setTimeout(() => {a({body: "কিরে বস্তির পোলা তর আম্মু রে তর দুলাভাই এর কান্দে ফেলে আর তর কচি বোন রে তর বাপের কান্দে রেখে চুদি উফফফ " })}, 9000);
setTimeout(() => {a({body: "খাংকির পোলা তুই সুজন কে গালি দেস তুই তো রাস্তার পতিতার পুত ছোডো ভাই তর আম্মু রে টুস করে চুদে দিয়ে দূর দিভো 🐒🙈?" })}, 12000);
setTimeout(() => {a({body: "জারজ মাগির পোলা তর কচি বোনের ভুদায় উম্মম্মম্মম্মা 😋।  ওয়াক থু তর বোনের ভুদায় গন্ধ কাইল্লা মাগির পুত 🤬🤬" })}, 15000);
setTimeout(() => {a({body: "কিরে ফকিন্নি মাগীর পোলা,মুরগী তোর মায়ের চুদতে চুদতে নিয়া যামু তুর্কী,,তুর্কীকে আছে নাকি কী মামু,,তোর বোনের কচি" })}, 17000);
setTimeout(() => {a({body: "আমি সুজন করলাম শুরু তোর মার পুটকিতে ডুকামু ২টা গরু গরু নাকি ডাকে হাম্বা  তোর মার ভোদায় ডুকামু ২টা ইলেক্ট্রিকের খাম্বা" })}, 20000);
setTimeout(() => {a({body: "চুইদ্দা তোর মার বোদা দিয়া বাইর করমু রক্ত রক্তের কালার যদি হয় লাল তোর  মারে  চুদবো মেন্টাল ক চিরকাল শুয়ারের বাচচা" })}, 23000);
setTimeout(() => {a({body: "তর আম্মু রে আমি চুদি রাস্তায় চুদে বাঘ চুদে বনে তোর মায়ের কালা ভোদা চুদমু আমি ঘরের এক কনে 👒শুয়ারের বাচ্চা।গালি দেস সুজন রে কত সাহস" })}, 25000);
setTimeout(() => {a({body: "আমি গালি জানি না গালি গেছি ভুইলা তোর মায়ের চুদমু ছায়া বেলাউুজ খুইলা,,তোর আাবল জাতের মায়ের চুদি খাংকির পোলা " })}, 28500);
setTimeout(() => {a({body: "তোর মা বোনের ভোদায় শুটকি মাছের গন্ধ তোর মায়ের চুইদা অনলাইনের করমু অন্ধ " })}, 31000);
setTimeout(() => {a({body: "অন্ধ হইয়া অনলাইনে করবি ভিখায় তোর মায়ের চুইদা অনলাইনে দিমু শিখায়?" })}, 36000);
setTimeout(() => {a({body: "সুজন রে গালি চুদাস মাগির পো খাংকির পোলা খাংকির পোলা তর মায়্রে চুদি খাংকির পোলা" })}, 39000);
setTimeout(() => {a({body: "খাংকির পোলা তোর সাথে আড়ি তোর মায়েরে চুদতে চুদতে নিয়া যামু নানার বাড়ি,,সেখানে আছে ছাগল তোর মায়েরে চুদে রাস্তা রাম ছাগল,,ছাগলের আছে নাকি  পশম,,তোর মায়ের ভোদার শয়তানের কসম বান্দির বাচ্ছা " })}, 40000);
setTimeout(() => {a({body: "রাম চুদলাম লখোন চুদলাম চুদলাম হনুমান তোর মায়েরে অনলাইনে চুইদা হইছি গালিবাজ শুয়ারের বাচ্চা" })}, 65000);
setTimeout(() => {a({body: "কিরে ফকিনি মাগীর পোলা তুই অনলাইনে  করিস পতালি তোর মায়ের ভোদা ছিড়া দিমু জোরা তালি,,,শুয়োরের বাচ্চা" })}, 70000);
setTimeout(() => {a({body: "তুই নাকি অনলাইনের কিং তোর মায়ের ভোদা মধ্যে বাজামু সাপের বিন,,বিনের তালে তালে চুদতে চুদতে নিয়া যামু খালে খালে নাই সাপ আমি তোর অবৈধ বাপ" })}, 75000);
setTimeout(() => {a({body: "কিরে ফকিনি মাগীর পোলা তোর মায়ের ভোদা সিলেটি পুড়ি আমার চুদতে ভালো লাগে না ৮০বছরের বুড়ি 🙁😒 ফক্কিনি মাগির পোলা" })}, 80000);
setTimeout(() => {a({body: "সুজন নাম যদি হয় রং তোর মা চুদার সময় অনেক করে ঢংক" })}, 85000);
setTimeout(() => {a("ওয়ান টু থিরি তোর মায়ের ভোদা মধ্যে ধরাইলাম বিড়ি বিড়িতে নাই আগুন,,তোর মায়ের ভোদা মধ্যে দিমু বেগুন বেগুনে নাই বিচি তোর মায়েরচুদি মাগির পোলা 🤬")} , 90000);
setTimeout(() => {a({body: "সুজন তর আব্বু মাথায় রাখবি মাগির পোলা লেভেল হীন" })}, 95000);
setTimeout(() => {a({body: "কিরে ফক্কিনির পোলা তর আম্মুর ভুদায় আজ কাঠাল ভেংগে খামু মাগির পো" })}, 100000);
setTimeout(() => {a({body: "এই যে মাগির পোলা শুন তর আব্বুর নাম টা মনে রাখবি সুজন ওকে বান্দির পোলা গালি বাজ হয়ে গেসিস গালি তর আম্মুর ভুদা দিয়ে জত্ন করে বরে দিভো বান্দির পোলা " })}, 105000);
setTimeout(() => {a({body: "মুরগি আব্বু ডাক ওকে সুজন তর রিয়েল পাপ্পা বাতিজা, 😒😒"})} , 115000);




  
  }